import { $t } from "@common/locales"

/* 本组件不在页面渲染，只是为了让i18next-scanner能找到从接口传递的、需要翻译的字段 */
export const TranslateWord = ()=>{
    return (
        <>
            {$t('文件日志')}
            {$t('HTTP日志')}
            {$t('Kafka日志')}
            {$t('NSQ日志')}
            {$t('Syslog日志')}
            {$t('未分配')}
            {$t('超级管理员')}
            {$t('团队管理员')}
            {$t('运维管理员')}
            {$t('普通成员')}
            {$t('只读成员')}
            {$t('服务管理员')}
            {$t('服务开发者')}
            {$t('应用开发者')}
            {$t('应用管理员')}
            {$t('驱动名称')}
            {$t('请求失败数')}
            {$t('转发失败数')}
            {$t('作用范围')}
            {$t('添加条目')}
            {$t('添加地址')}
            {$t('文件名称')}
            {$t('存放目录')}
            {$t('日志分割周期')}
            {$t('过期时间')}
            {$t('单位：天')}
            {$t('输出格式')}
            {$t('格式化配置')}
            {$t('服务器地址')}
            {$t('Access日志')}
            {$t('NSQD地址列表')}
            {$t('鉴权Secret')}
            {$t('网络协议')}
            {$t('日志等级')}
            {$t('单行')}
            {$t('小时')}
            {$t('天')}
            {$t('未发布')}
            {$t('待发布')}
            {$t('单位：s，最小值：1')}
        </>
    )
}